Makro/Pruebas/Prueba 6.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:OnlineGeneration>
         <!--Optional:-->
         <tem:ruc>900059238</tem:ruc>
         <!--Optional:-->
         <tem:Login/>
         <!--Optional:-->
         <tem:clave>88833C6E-AD43-4E7D-9A9F-132199692827</tem:clave>
         <!--Optional:-->
         <tem:docTxt>EN|01|F|SETT|15|2022-02-08|11:48:00|COP||1|31|900059238|MAKRO|MAKRO SUPERMAYORISTA S.A.S|23001|||MONTERIA|23||Cra.  14  No.  48 A 42 |CO|48|2|13|15035930|MIGUEL FRANCISCO CORDERO CALDE|MIGUEL FRANCISCO CORDERO CALDE||||||MONTERIA|CR 15  15B-07|CO|49|128066.61|123866.61|143435.00|0.00|0.00|0.00|143435.00
ENEX|UBL 2.1|10|||||||2022-02-08||11:48:00||4690;4649;4711;4731|es|es|5|23001|MONTERIA|CORDOBA|23|Cra.  14  No.  48 A 42 |CO|Colombia||13|||23001|MONTERIA|CORDOBA|23|CR 15  15B-07|CO|Colombia||13|18|16FD|01552666|23|Colombia|23001|CORDOBA|Colombia|23|111711|111711
RS|2022-02-17|2028-02-17|SETT|1|1000000||1702202246542
DE|1|114929|BO|1.00|8823.53|8823.53||0.00||false
DEDI|NECTAR CALIFORNIA LIGHT 300mlX6u
DEDI|10500.00
DEDIEX||999|1|||
DEIM|1676.47|8823.53|1676.47|19.00|01|IVA||BO|1676.47
DE|2|132749|C62|48.00|840.34|38722.68||0.00||false
DEDI|PANELADA SABOR LIMON 29g
DEDI|46080.00
DEDIEX||999|1|||
DEIM|7357.31|38722.68|7357.31|19.00|01|IVA||C62|153.28
DEDR|false|1613.45|4.00|||40336.13
DE|3|117048|C62|1.00|3277.31|3277.31||0.00||false
DEDI|TE HATSU AMARILLO 400ml
DEDI|3900.00
DEDIEX||999|1|||
DEIM|622.69|3277.31|622.69|19.00|01|IVA||C62|622.69
DE|4|128163|C62|1.00|6200.00|6200.00||0.00||false
DEDI|ARROZ CASTELLANO INTEGRAL 1000g
DEDI|6200.00
DEDIEX||999|1|||
DEIM|0.00|6200.00|0.00|0.00|01|IVA||C62|0.00
DE|5|117053|C62|2.00|3277.31|6554.62||0.00||false
DEDI|TE HATSU VERDE 400ml
DEDI|7800.00
DEDIEX||999|1|||
DEIM|1245.38|6554.62|1245.38|19.00|01|IVA||C62|622.69
DE|6|120906|KGM|1.12|10000.00|7805.00||0.00||false
DEDI|COLIFLOR kg
DEDI|7805.00
DEDIEX||999|1|||
DEIM|0.00|7805.00|0.00|0.00|01|IVA||KGM|0.00
DEDR|false|3345.00|30.00|||11150.00
DE|7|137014|C62|1.00|1600.00|1600.00||0.00||false
DEDI|.ARROZ CANASTA BASICA BOLSA 500g
DEDI|1600.00
DEDI|137025
DEDI|CANASTA BASICA BOLSA NACIONAL
DEDI|1
DEDIEX||999|1|||
DE|8|137015|C62|1.00|1800.00|1800.00||0.00||false
DEDI|.ARVEJA VERDE CANASTA BASICA 454
DEDI|1800.00
DEDI|137025
DEDI|CANASTA BASICA BOLSA NACIONAL
DEDI|1
DEDIEX||999|1|||
DE|9|137016|C62|1.00|800.00|800.00||0.00||false
DEDI|.SAL REFISAL CANASTA BASICA BOLS
DEDI|800.00
DEDI|137025
DEDI|CANASTA BASICA BOLSA NACIONAL
DEDI|1
DEDIEX||999|1|||
DE|10|137017|C62|1.00|1428.57|1428.57||0.00||false
DEDI|.HARINA TRIGO CANASTA BASICA 500
DEDI|1500.00
DEDI|137025
DEDI|CANASTA BASICA BOLSA NACIONAL
DEDI|1
DEDIEX||999|1|||
DEIM|71.43|1428.57|71.43|5.00|01|IVA||C62|71.43
DE|11|137018|C62|1.00|2571.43|2571.43||0.00||false
DEDI|.CAFE MARISCAL CANASTA BASICA 12
DEDI|2700.00
DEDI|137025
DEDI|CANASTA BASICA BOLSA NACIONAL
DEDI|1
DEDIEX||999|1|||
DEIM|128.57|2571.43|128.57|5.00|01|IVA||C62|128.57
DE|12|137019|C62|1.00|809.52|809.52||0.00||false
DEDI|.AVENA HOJUELA CANASTA BASICA 13
DEDI|850.00
DEDI|137025
DEDI|CANASTA BASICA BOLSA NACIONAL
DEDI|1
DEDIEX||999|1|||
DEIM|40.48|809.52|40.48|5.00|01|IVA||C62|40.48
DE|13|137021|C62|1.00|1190.48|1190.48||0.00||false
DEDI|.SPAGUETTI CANASTA BASICA 250g
DEDI|1250.00
DEDI|137025
DEDI|CANASTA BASICA BOLSA NACIONAL
DEDI|1
DEDIEX||999|1|||
DEIM|59.52|1190.48|59.52|5.00|01|IVA||C62|59.52
DE|14|137022|C62|1.00|2380.95|2380.95||0.00||false
DEDI|.AZUCAR INAUCA CANASTA BASICA 50
DEDI|2500.00
DEDI|137025
DEDI|CANASTA BASICA BOLSA NACIONAL
DEDI|1
DEDIEX||999|1|||
DEIM|119.05|2380.95|119.05|5.00|01|IVA||C62|119.05
DE|15|137023|C62|1.00|4075.63|4075.63||0.00||false
DEDI|.ACEITE SABRSI CANASTA BASICA 45
DEDI|4850.00
DEDI|137025
DEDI|CANASTA BASICA BOLSA NACIONAL
DEDI|1
DEDIEX||999|1|||
DEIM|774.37|4075.63|774.37|19.00|01|IVA||C62|774.37
DE|16|137024|C62|1.00|1764.71|1764.71||0.00||false
DEDI|.ATUN CANASTA BASICA BOLSA 170g
DEDI|2100.00
DEDI|137025
DEDI|CANASTA BASICA BOLSA NACIONAL
DEDI|1
DEDIEX||999|1|||
DEIM|335.29|1764.71|335.29|19.00|01|IVA||C62|335.29
DE|17|14877|BO|1.00|19327.73|15462.18||0.00||false
DEDI|*LIMPIADO FABULOSO LAVANDA 5l
DEDI|18400.00
DEDIEX||999|1|||
DEIM|2937.81|15462.18|2937.81|19.00|01|IVA||BO|2937.81
DEDR|false|3865.55|20.00|||19327.73
DE|18|131844|C62|1.00|22800.00|22800.00||0.00||false
DEDI|ALCOHOL ANTISPTCO CAPIBELL 3700ml
DEDI|22800.00
DEDIEX||999|1|||
DEIM|0.00|22800.00|0.00|0.00|01|IVA||C62|0.00
DIT|15367.99
DI||36805.00|0.00|0.00|01|0.00|IVA||
DI||78681.01|14948.99|19.00|01|14948.99|IVA||
DI||8381.00|419.00|5.00|01|419.00|IVA||
FP|1|48|2022-02-08|2216017568876
PE|Plantilla|T01_MBS.jasper
PE|CodigoBarras|220390101151010770129
PE|PPLTienda|ST16
PE|PPLCaja|1
PE|prom|0
PE|zona|N/A
PE|idInterno|1 2022039010
PE|CentroDistribucion|MAKRO MONTERIA
PE|DirCentroDistribucion|Cra.  14  No.  48 A 42 
PE|TelCentroDistribucion|N/A
PE|CorreoDist|
PE|PasaporteCliente|16-221570
PE|BarrioCliente|SAHAGUN
PE|TelefonoCliente|N/A
PE|vrPuntosCMR|0.00
PE|vrEfectivo|0.00
PE|vrTdebito|0.00
PE|vrCheque|0.00
PE|vrChequePost|0.00
PE|vrBonos|0.00
PE|vrTcredito|143435.00
PE|vrTprivada|0.00
PE|vrNotaCredito|0.00
PE|vrCreditoDirecto|0.00
PE|vrDonacion|0.00
PE|vrCambio|0.00
PE|PuntosCMR|42
PE|CorteCMR|07/02/2022
PE|Caja|1 77
PE|TotalArticulos|57
PE|TextoFecha|08-02-2022     11:51     1601 2022039010
PES|CentroDist
PESD|1|MAKRO MONTERIA
PESD|2|Cra.  14  No.  48 A 42 
PES|ResolucionesFactura
PESD|1|AGENTE RETENEDOR IVA RES.00812 30/1/2006
PESD|2|REG.COMUN GRAN CONTRIB Res.9061 Dic/2020
PESD|3|AUTORETENEDORES DEL IMPUESTO DE RENTA SEGUN RESOL No 1524 DE FEB 20 DE 2006
PES|Regimen
PESD|1|REG.COMUN GRAN CONTRIB Res.9061 Dic/2020
PESD|2| AUTORETENEDORES DEL IMPUESTO DE RENTA  
PESD|3| SEGUN RESOL No 1524 DE FEB 20 DE 2006  
PESD|4|        AGENTE RETENEDOR DE IVA         
PESD|5|      RESOLUCION 00812 30/01/2006       
PESD|6|
PESD|7|
PESD|8|
PES|CambioMercancia
PESD|1|(*)BIENES EXENTOS - DECRETO 417 DE 2020       CAMBIOS DENTRO DE LOS 7 DIAS HABILES A   PARTIR DE LA COMPRA,PRESENTA LA FACTURA 
PES|Falabella
PESD|1|Gracias por tu visita
PESD|2|
PESD|3|
CTE||||dte_9000592385@dte.paperless.com.co|
CTR|||||
TRE|O-13;O-15|IVA|01
TRR|R-99-PN|IVA|01</tem:docTxt>
         <!--Optional:-->
         <tem:tipoFoliacion>1</tem:tipoFoliacion>
         <!--Optional:-->
         <tem:tipoRetorno>5</tem:tipoRetorno>
      </tem:OnlineGeneration>
   </soapenv:Body>
</soapenv:Envelope>